Repository: ivan-perevala/camera_projection_painter_manual
Catalog: locale/*/LC_MESSAGES/props.po
Languages: uk

source: Camera
uk: Камера

source: Image
uk: Зображення

source: Camera binded image. It will be used as a paint brush. Also, its size affects the distortion parameters in the pixel coordinate system (in which way - described in more detail for the corresponding parameters), and therefore - also the possibility of exporting to certain file formats
uk: Зображення пов'язане до камери. Буде використано як кисть для малювання. Його розмір впливає на пареметри дисторсії в піксельній системі координат (у який спосіб - детальніше описано для окремих параметрів), а значить - також на можливість експорту в певні формати файлів

source: Millimeters Focal Length
uk: Фокальна Відстань в Міліметрах

source: Focal length of the camera in millimeters. The value is stored with double precision
uk: Фокальна відстань камери у міліметрах. Значення зберігається з подвійною точністю

source: Pixels Focal Length
uk: Фокальна Відстань у Пікселях

source: The focal length of the camera in pixels. Calculated by the formula:
uk: Фокальна відстань камери у пікселях. Значення може бути відображене з подвійною точністю. Обраховується за формулою:

source: where `F` is the focal length in millimeters, `P` is the larger side of the image, `S` is the size of the camera sensor in millimeters
uk: де `F` - фокальна відстань у міліметрах, `P` - більша сторона зображення, `S` - розмір сенсору камери у міліметрах

source: Sensor
uk: Сенсор

source: The size of the camera sensor in millimeters, taking into account the larger side of the attached image. This means that if the sensor fit option is set to horizontal - the width of the sensor will be used for calculations, for vertical fit type - height accordingly. These values can be set manually. But for when working with photogrammetric scenes, it is necessary to use the automatic type of sensor adjustment. In this case, if the image has a landscape orientation (or the sides are equal), the width of the sensor will be used, and in the case of a portrait - the height of the sensor. As you can see, there are opportunities for using non-standard workflows, but the main mode of operation is the automatic sensor type. Also note the camera-bound image, this is important for importing and exporting to some file formats. The value is stored with double precision
uk: Розмір сенсору камери у міліметрах, зважаючи на більшу сторону прив'язаного зображення. Це означає що якщо параметр підгонки сенсора встановлено на горизонтальний - буде використано ширину сенсора для обрахунків, для вертикального типу підгонки - відповідно висоту. Ці значення можна встановити вручну. Але для роботи саме з фотограметричними сценами необхідно використовувати автоматичний тип підгонки сенсора. В такому разі якщо зображення має альбомну орієнтацію (або сторони рівні) - буде використано ширину сенсора, а у випадку портретної - висоту. Як бачите, тут присутні можливості для використання нестандартних робочих процесів, але основним способом роботи є автоматичний тип сенсора. Також зважайте на наявність прив'язаного до камери зображення, це важливо для імпорту і експорту в деякі формати файлів. Значення зберігається з подвійною точністю

source: Millimeters Skew
uk: Зсув у Міліметрах

source: The horizontal skew of the image in millimeters relative to its center, excluding principal deviation. The value is stored with double precision
uk: Горизонтальний зсув зображення у міліметрах відносно його центру без урахування відхилення. Значення зберігається з подвійною точністю

source: Pixels Skew
uk: Зсув у Пікселях

source: Horizontal skew of the image in pixels relative to its center without taking into account deviation. Calculated by the formula:
uk: Горизонтальний зсув зображення у пікселях відносно його центру без урахування відхилення. Обраховується за формулою:

source: `Pixels Skew = S * P`
uk: `Зсув = S * P`

source: where `S` is the skew value in millimeters, `P` is the size of the larger side of the image
uk: де `S` - значення зсуву у міліметрах, `P` - розмір більшої сторони зображення

source: Aspect Ratio
uk: Співвідношення Сторін

source: Image aspect ratio correction factor. It means the ratio of the height of the image to its width - that is, values ​​greater than 1.0 will stretch it vertically, smaller values ​​will compress it. The value is stored with double precision
uk: Фактор корекції співвідношення сторін зображення. Мається на увазі співвідношення висоти зображення до його ширини - тобто значення більше 1.0 розтягнуть його по вертикалі, менші ж - стиснуть. Значення зберігається з подвійною точністю

source: Millimeters Principal X
uk: Відхилення у Міліметрах X

source: The deviation from the center of the image in millimeters along the X axis. Calculated by the formula:
uk: Відхилення від центру зображення у міліметрах за віссю X. Обраховується за формулою:

source: where `Px' is the deviation factor, `S' is the size of the camera sensor
uk: де `Px` - фактор відхилення, `S` - розмір сенсора камери

source: Millimeters Principal Y
uk: Відхилення у Міліметрах Y

source: The deviation from the center of the image in millimeters along the Y axis. Calculated by the formula:
uk: Відхилення від центру зображення у міліметрах за віссю Y. Обраховується за формулою:

source: where `Py' is the deviation factor, `S' is the size of the camera sensor
uk: де `Py` - фактор відхилення, `S` - розмір сенсора камери

source: Pixels Principal
uk: Відхилення у Пікселях

source: The deviation from the center of the image in pixels. Calculated by the formula:
uk: Відхилення від центру зображення у пікселях. Обраховується за формулою:

source: where `Pxy` is the deviation factor, `L` is the larger side of the image, `Sxy` is the image size
uk: де `Pxy` - фактор відхилення, `L` - більша сторона зображення, `Sxy` - розмір зображення

source: Distortion Model
uk: Модель Дисторсії

source: Mathematical model of lens distortion. Note that distortion coefficients may be inconsistent between different distortion models
uk: Математична модель дисторсії лінзи. Майте на увазі що коефіцієнти дисторсії можуть бути несумісними між різними моделями дисторсії

source: None
uk: Немає

source: No distortion, only correction
uk: Без дисторсії, лише корекція

source: Division
uk: Ділення

source: The division model with two radial distortion coefficients. This is the simplest mathematical model of linear division of image coordinates, which can be used if the distortion is small, for example, for scenes where the shooting took place close to the object
uk: Модель ділення з двома коефіцієнтами радіальної дисторсії. Це найпростіша математична модель лінійного поділу координат зображення, яку можна використати якщо дисторсія невелика, наприклад для сцен де зйомка відбувалася близько до об'єкта

source: Polynomial
uk: Поліноміальна

source: A polynomial model with four radial and two tangential distortion coefficients. It uses polynomial functions instead of simple linear division, so it is a more accurate and flexible model that can be used for complex scenes with significant lens distortions
uk: Поліноміальна модель з чотирма радіальними і двома тангенціальними коефіцієнтами дисторсії. Вона використовує поліноміальні функції замість простого лінійного ділення тому це більш точна і гнучка модель, яку можна використати для комплексних сцен зі значними спотворення об'єктива

source: Brown-Conrady
uk: Брауна-Конраді

source: Brown-Conrady polynomial model with four with four radial and two tangential distortion coefficients. It is the most accurate and flexible model that can be used for complex scenes with significant lens distortions. In general, it is used when a simple linear division model is no longer sufficient
uk: Поліноміальна модель Брауна-Конраді з чотирма радіальними і двома тангенціальними коефіцієнтами дисторсії. Це більш точна і гнучка модель, яку можна використати для комплексних сцен зі значними спотворення об'єктива. Загалом, її використовують коли моделі простого лінійного ділення вже не достатньо

source: Represents linear radial distortion. It corrects or introduces distortion that increases linearly with radial distance. The value is stored with double precision
uk: Представляє лінійне радіальне спотворення. Він коригує або вносить викривлення, що лінійно зростає з радіальною відстанню. Значення зберігається з подвійною точністю

source: Represents cubic radial distortion. It corrects or introduces distortion that increases with the cube of the radial distance. The value is stored with double precision
uk: Представляє кубічне радіальне викривлення. Він коригує або вносить викривлення, що збільшується разом із кубом радіальної відстані. Значення зберігається з подвійною точністю

source: Represents quintic (fifth-order) radial distortion. It corrects or introduces distortion that increases with the fifth power of the radial distance. The value is stored with double precision
uk: Представляє квінтичне (п’ятого порядку) радіальне викривлення. Він виправляє або вносить викривлення, що збільшується з п’ятим ступенем радіальної відстані. Значення зберігається з подвійною точністю

source: Represents seventh-order radial distortion. It corrects or introduces distortion that increases with the seventh power of the radial distance. The value is stored with double precision
uk: Представляє радіальне викривлення сьомого порядку. Він виправляє або вносить викривлення, що збільшується із збільшенням радіальної відстані в сьомому ступені. Значення зберігається з подвійною точністю

source: Represents linear tangential distortion. Corrects or introduces distortion that increases linearly with the distance from the image center. The value is stored with double precision
uk: Представляє лінійне тангенціальне спотворення. Виправляє або вносить спотворення, що лінійно зростає з відстанню від центру зображення. Значення зберігається з подвійною точністю

source: Represents quadratic tangential distortion. Corrects or introduces distortion that increases with the square of the distance from the image center. The value is stored with double precision
uk: Представляє квадратичне тангенціальне викривлення. Виправляє або вносить спотворення, що збільшується з квадратом відстані від центру зображення. Значення зберігається з подвійною точністю

source: Bind History
uk: Історія Зображень

source: Images that were previously binded to this camera. The option is used if, for example, it is necessary to draw some area from another image, and then return to the previous one. Of course, this is not a standard workflow, but it is used sometimes
uk: Зображення що раніше були пов'язані з цією камерою. Опція використовується якщо наприклад, необхідно намалювати якусь ділянку з іншого зображення, а потім повернутися до попереднього. Звісно, це не стандартний спосіб роботи але інколи використовується

source: The image that was previously attached to this camera
uk: Зображення що раніше було прив'язане до цієї камери

source: Reality Capture Properties
uk: Параметри Reality Capture

source: Preferences
uk: Налаштування

source: Use Mesh Preview
uk: Відображення Прев'ю Сітки

source: Use mesh preview for brush and inspection. This option can be useful to significantly reduce the use of video memory, for example, if the purpose of using the addon is only to import and export cameras. The current implementation of Blender forces the display to save the object's data and re-render it, just to show the brush preview. Of course, this is convenient, but it significantly increases the load on the system. Therefore, if it is not critical for you to see a preview of the brush you are drawing with, you can disable the preview
uk: Чи використовувати попередній перегляд для кисті. Опція може бути корисною для того щоб значно зменшити використання відеопам'яті, наприклад, якщо доповнення використовується лише для імпорту і експорту камер. Поточна імплементація Blender змушує додатково зберігати дані об'єкту і повторно їх відображувати, лише для того аби показати попередній перегляд кисті. Звісно, це зручно але значно збільшує завантаження системи. Тому якщо відображення попереднього перегляду кисті не критичне, його можна просто вимкнути

source: Use Previews
uk: Попередній Перегляд

source: Use image previews. Whether to generate and display image previews in the viewport. This does not significantly increase the amount of video memory, but it can cause small friezes in the viewport. The generation system works according to the principle of displaying the necessary previews. That is, all camera frames in the observer's field of view will be added to the render queue. Of course, the faster you read data from the disk, the faster it will be generated. The camera on which the cursor is hovered on is always added to render queue first
uk: Використовувати попередній перегляд зображень. Чи генерувати і відображувати попередній перегляд зображень у вікні перегляду. Це не надто збільшить кількість використаної відеопам'яті, проте може спричинити незначні переривання у роботі вікна перегляду.

source: Dithering Strength
uk: Сила дизерингу

source: 8x8 Bayer dithering strength. The resolution of the previews is rather small - 128x128 pixels. Of course, this add-on performs smoothing of the generated previews, but for a clearer understanding of what is shown, you can use dithering and mix it with the original preview
uk: Сила дизерингу Байера 8х8. Роздільна здатність зображень попереднього перегляду є доволі малою - 128х128 пікселів. Звісно, доповнення виконує згладжування згенерованих прев'ю, але для покращення читальності відображеного, можна використати дизеринг і змішати його з оригінальним прев'ю

source: Smooth Previews
uk: Згладжування Попереднього Перегляду

source: Use fast approximated anti-aliasing for preview images. Blender generates previews as Nearest, so readability is lost. This option does not add more data from the original image but performs smoothing and thus makes it more readable
uk: Використати спрощене згладжування для зображень попереднього перегляду. Blender створює їх без згладжування, тому іноді вони не читальні. Ця опція не додає ьільше даних з оригінального зображення, але робить попередній перегляд більш читальним

source: Cameras Transparency
uk: Прозорість Камер

source: Transparency of cameras in the viewport.
uk: Прозорість камер у вікні перегляду

source: Tooltip Preview Size
uk: Розмір Прев'ю Підказки

source: The size of the preview image in the tooltip. Does not affect the quality of the displayed preview, only its size
uk: Розмір зображення попереднього перегляду в підказці. Не впливає на якість зображень попереднього перегляду, лише на їх розмір.

source: Normal
uk: Нормальний

source: Standard size, 128x128 pixels
uk: Стандартний розмір, 128х128 пікселів

source: Large
uk: Збільшений

source: Stretched to double size
uk: Двічі розтягнутий стандартний розмір

source: Tooltip Position
uk: Розташування Підказки

source: The location of the pop-up tooltip with information about the camera data on which the cursor is hovered
uk: Розташування плаваючої підказки з інформацією про дані камери на яку наведено курсор

source: Static
uk: Статична

source: Appears near the brush and remains in the place where it appeared
uk: З'являється поблизу кисті і залишається в тому місці де з'явилась

source: Floating
uk: Плаваюча

source: Appears and follows the brush
uk: З'являється поблизу кисті і слідує за нею

source: Fixed
uk: Фіксована

source: Appears only at the bottom of the screen, in the middle
uk: З'являється внизу екрану, посередині

source: Software
uk: Програмне Забезпечення

source: Preset for software for which the operation will be performed
uk: Попередні налаштування для програмного забазпечення для якого буде виконано операцію

source: Use presets for Reality Capture
uk: Використовувати попередні налаштування для Reality Capture

source: Select Framebuffer Scale
uk: Масштаб Буфера Кадру Виділення

source: Select framebuffer scale percentage, available in "Developer Extras" section. This exists mostly for optimization purposes, since the smaller size of framebuffer significantly reduces the use of both memory and CPU. The point is that the data from framebuffer will be read not only in one particular place, but also to determine which cameras in the field of view of the observer and require rendering of preview. Changing this option requires restarting the active main operator
uk: Масштаб у відсотках для буфера кадру виділення, доступний у вкладці "Додатки Розробника". Необхідно для оптимізації, оскільки менший розмір буфера кадру значно зменшує навантаження як процесора так і відеокарти. Основним є те що дані буде зчитано не лише в одній конкретній точці, але також і всі разом, аби з'ясувати які камери знаходяться в полі зору спостерігача і потребують оновлення щображень попереднього перегляду. Необхідно перезавантажити основний оператор доповнення якщо опцію було змінено.

source: Log Level
uk: Рівень Логу

source: The level of the log that will be output to the console. For log to file, this level value will not change
uk: Рівень логу для консолі. Для логу в файл це значення рівня нічого не змінить

source: Debug
uk: Налагодження

source: Debug messages (low priority)
uk: Повідомлення налагодження (низький пріоритет)

source: Info
uk: Інформація

source: Informational messages
uk: Інформаційні повідомлення

source: Warning
uk: Попередження

source: Warning messages (medium priority)
uk: Попередження (середній пріоритет)

source: Error
uk: Помилки

source: Error messages (high priority)
uk: Повідомлення про помилки (високий пріоритет)

source: Critical
uk: Критичні

source: Critical error messages
uk: Повідомлення про критичні помилки

source: Scene
uk: Сцена

source: Unit
uk: Одиниці

source: Display units of camera parameters
uk: Одиниці відображення парамерів камери

source: Millimeters
uk: Міліметри

source: Camera parameters in millimeters
uk: Параметри камери у міліметрах

source: Pixels
uk: Пікселі

source: Camera parameters relative to image sizes in pixels
uk: Параметри камери відносно розміру зображення у пікселях

source: Highlight Cameras Orientation
uk: Показати Орієнтацію Камер

source: Use a different color for cameras whose images have landscape (including square) and portrait orientation
uk: Використати різні кольори для камер у яких зображення ландшафтної (включно з квадратними), чи портретної орієнтації

source: Cameras Landscape Orientation Color
uk: Колір Камер Ландшафтної Орієнтації

source: The color of the display of cameras in which the images have a landscape (including square) orientation
uk: Колір відображення камер з ландшафтною (включно з квадратними зображеннями) орієнтацією

source: Cameras Portrait Orientation Color
uk: Колір Камер Портретної Орієнтації

source: The color of the display of cameras in which the images have a portrait orientation
uk: Колір відображення камер з портретною орієнтацією

source: Highlight Projected Border
uk: Показати Спроектовану Рамку

source: Whether to highlight the borders of the frame of the projected image on the object
uk: Чи показувати рамку спроектораного на об'єкт зображення

source: Highlight Projected Border First Color
uk: Перший Колір Спроектованої Рамки

source: The first color that will be used to highlight the parts of the object that are outside of camera frustum
uk: Перший колір що буде використано для відображення частин об'єкта що знаходяться за межами зображення

source: Highlight Projected Border Second Color
uk: Другий Колір Спроектованої Рамки

source: The second color that will be used to highlight the parts of the object that are outside of camera frustum
uk: Другий колір що буде використано для відображення частин об'єкта що знаходяться за межами зображення

source: Highlight Projected Border Type
uk: Тип Рамки

source: The fill type of the highlighted area
uk: Тип заповнення відображення

source: Fill Color
uk: Колір заповнення

source: Single color outline
uk: Заповнення суцільним кольором

source: Checker
uk: Шашки

source: Checker pattern outline
uk: Заповнення шашками

source: Lines
uk: Лінії

source: Lines pattern outline
uk: Заповнення похилими лініями

source: Highlight Projected Border Facing
uk: Сторона Спроектованої Рамки

source: Which side of the polygons that are outside the frame of the projected image to display. Сan be useful for a scene where there is a closed space, for example a room or a street. At least one of the options should be selected
uk: Яку сторону граней що знаходяться за межами рамки спроектованого зображення буде відображено. Може бути корисним для сцен з замкнутим простором, наприклад, вулиці чи кімнати. Повинна бути обрана принаймні одна опція

source: Show the front of polygons
uk: Показувати лицьову сторону граней

source: Show the back of polygons
uk: Показувати зворотню сторону граней

source: Viewport Cameras Size
uk: Розмір Камер

source: The size of the cameras in the viewport
uk: Розмір камер у вікні перегляду

source: Current Image Viewport Transparency
uk: Прозорість поточного зображення у вікні перегляду

source: Transparency of the image when viewed from the camera
uk: Прозорість зображення коли дивитися з камери

source: Cage
uk: Регіон

source: Allows you to distinguish a certain region for work. Useful for large scenes with lots of cameras
uk: Дозволяє виокремити певний регіон для роботи. Корисно для великих сцен з великою кількістю камер

source: Cage Usage
uk: Використання Регіону

source: In which way the region for work affects the scene display
uk: В який спосіб регіон для роботи впливає на відображення сцени

source: Hides the cameras
uk: Ховає камери

source: Previews
uk: Попередній Перегляд

source: Stops rendering of previews outside the region
uk: Припиняє рендеринг зображень попереднього перегляду за межами регіону

source: Mesh Preview
uk: Відображення Прев'ю Сітки

source: Hides the projection of the object outside the region
uk: Приховує проекцію об'єкту поза межами регіону

source: Window Manager
uk: Менеджер Вікон

source: Configure UDIM
uk: Налаштувати UDIM

source: The add-on uses some standard methods for importing, but in certain situations this creates incorrect data for the add-on to work with. If this option is activated, after importing the object, the materials for working with UDIM textures will be set, and after selecting the canvas, the image settings will be checked and adjusted
uk: Доповнення використовує деякі стандартні методи для імпорту, але в певних ситуаціях це створює некоректні для роботи з доповненням дані. Якщо дана опція активована то після імпорту об'єкту відбудеться налаштування матеріалів для роботи з UDIM текстурами, а після вибору полотна - перевірка і корегування налаштувань зображення
